# Heading1

In [2]:
print("hello")
print("jupyter")

hello
jupyter

In [1]:
import pandas as pd
import numpy as np

In [2]:
car_sale = pd.read_csv("car-sales.csv")
car_sale.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

# Selection

## Select By Columns Name

In [6]:
name = car_sale["Make"]
name.head()

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
Name: Make, dtype: object

In [7]:
car_sale[0:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [8]:
car_sale.loc[0]

Make                Toyota
Colour               White
Odometer (KM)       150043
Doors                    4
Price            $4,000.00
Name: 0, dtype: object

In [10]:
car_sale.iloc[2]

Make                Toyota
Colour                Blue
Odometer (KM)        32549
Doors                    3
Price            $7,000.00
Name: 2, dtype: object

In [11]:
car_sale[car_sale["Colour"] == "Red"]

    Make Colour  Odometer (KM)  Doors      Price
1  Honda    Red          87899      4  $5,000.00